##############################################################################
# BASH CHEATSHEET (中文速查表)  -  by skywind (created on 2018/02/14)
# Version: 1, Last Modified: 2018/02/24 02:34
# https://github.com/skywind3000/awesome-cheatsheets
##############################################################################



##############################################################################
# 常用快捷键
##############################################################################

CTRL+A              # 移动到行首，同 <Home>
CTRL+B              # 向后移动，同 <Left>
CTRL+C              # 结束当前命令
CTRL+D              # 删除光标前的字符，同 <Delete> ，或者没有内容时，退出会话
CTRL+E              # 移动到行末，同 <End>
CTRL+F              # 向前移动，同 <Right>
CTRL+G              # 退出当前编辑，并响铃
CTRL+H              # 向后删除字符，同 <Backspace>
CTRL+K              # 向前删除到行末
CTRL+L              # 清屏并重新显示
CTRL+N              # 移动到命令历史的下一行，同 <Down>
CTRL+O              
CTRL+P              # 移动到命令历史的上一行，同 <Up>


